---
kind: property
id: P:Autodesk.Revit.DB.BoundingBoxXYZ.Enabled
zh: 包围盒
source: html/07f7ad25-2d1b-74a1-65e8-d91d3f81ea29.htm
---
# Autodesk.Revit.DB.BoundingBoxXYZ.Enabled Property

**中文**: 包围盒

Defines whether the entire bounding box is enabled.

## Syntax (C#)
```csharp
public bool Enabled { get; set; }
```

## Remarks
A disabled bounding box might be used to signal that the corresponding Revit functionality
is deactivated. For example, a disabled 3D view section box represents an inactive section box.